TingYun1/Learn_stm32/AT24C02(example)/User/USART/bsp_usart.h
#ifndef __BSP_USART_H
#define __BSP_USART_H

#include "stm32f10x.h"
#include "stm32f10x_usart.h"
#define DEBUG_USARTx                 USART2
#define DEBUG_USART_CLK              RCC_APB1Periph_USART2
#define DEBUG_USART_APBxClkCmd       RCC_APB1PeriphClockCmd
#define DEBUG_USART_BAUDRATE         115200


#define DEBUG_USART_GPIO_CLK        (RCC_APB2Periph_GPIOA)
#define DEBUG_USART_GPIO_APBxClkCmd  RCC_APB2PeriphClockCmd

#define DEBUG_USART_TX_GPIO_PORT     GPIOA
#define DEBUG_USART_TX_GPIO_PIN      GPIO_Pin_2
#define DEBUG_USART_RX_GPIO_PORT     GPIOA
#define DEBUG_USART_RX_GPIO_PIN      GPIO_Pin_3

#define DEBUG_USART_IRQ              USART2_IRQn            
#define DEBUG_USART_IRQHandler       USART2_IRQHandler


void USART_Config(void);
void Usart_SendByte(USART_TypeDef* pUSARTx,uint8_t data);
void Usart_SendHalfWord(USART_TypeDef* pUSARTx,uint16_t data);
void Usart_SendArr(USART_TypeDef* pUSARTx,uint8_t* arr,uint8_t num);
void Usart_SendStr(USART_TypeDef* pUSARTx,char* str);
#endif

